$(function(){
	function Announcement(opt){
		this.opt = opt;
		this.initDom();
	}

	Announcement.prototype.initDom = function(){
		var temp;

		this.button = new Button({
			id: 'announcement-info-button',
			name: '查询',
			width: 60,
			height: 25			
		});

		this.announcementData = [
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11'],
			[true, '尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’由此给你带来不便，还请多多谅解，感谢您一如既往的支持','2016-09-09&nbsp;11:11:11']					
		];

		this.pager = new Pager({
			id: 'announcement-pager',
			pageSize: 5,
			callback: this.bindData.bind(this),
			totalCount: this.announcementData.length
		});

		temp = '<div class="announcement-info znx-info-action">' +
						'<div class="bar-zone">' +
							'<div class="up">' +
								'<div class="time-section">' +
									'<span class="title">日期</span>' +
									'<input class="starttime" type="text"/>' +
									'<span class="divider">-</span>' +
									'<input class="endtime" type="text"/>' +
								'</div>' +

								this.button.getDom() +

								'<ul>' +
									'<li class="selected"><span>今日</span></li>' +
									'<li><span>昨日</span></li>' +
									'<li><span>3日</span></li>' +
									'<li><span>7日</span></li>' +
								'</ul>' +

								'<div class="clear"></div>' +
							'</div>' +

						'</div>' +

						'<div class="table-zone">' +
							'<table>' +
								'<thead><tr>' +
									'<th colspan="2">通知内容</th><th>时间</th>' +
								'</tr><thead>' +
								'<tbody>' +
									// '<tr>' +
									// 	'<td><input type="checkbox" checked="checked" /></td>' +
									// 	'<td><p>尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，' +
									// 	'部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’' +
									// 	'由此给你带来不便，还请多多谅解，感谢您一如既往的支持' +
									// 	'</p></td>' +
									// 	'<td>2016-09-09&nbsp;11:11:11</td>' +
									// '</tr>' +

									// '<tr class="even">' +
									// 	'<td><input type="checkbox" checked="checked" /></td>' +
									// 	'<td><p>尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，' +
									// 	'部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’' +
									// 	'由此给你带来不便，还请多多谅解，感谢您一如既往的支持' +
									// 	'</p></td>' +
									// 	'<td>2016-09-09&nbsp;11:11:11</td>' +
									// '</tr>' +

									// '<tr>' +
									// 	'<td><input type="checkbox" checked="checked" /></td>' +
									// 	'<td><p>尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，' +
									// 	'部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’' +
									// 	'由此给你带来不便，还请多多谅解，感谢您一如既往的支持' +
									// 	'</p></td>' +
									// 	'<td>2016-09-09&nbsp;11:11:11</td>' +
									// '</tr>' +

									// '<tr class="even">' +
									// 	'<td><input type="checkbox" checked="checked" /></td>' +
									// 	'<td><p>尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，' +
									// 	'部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’' +
									// 	'由此给你带来不便，还请多多谅解，感谢您一如既往的支持' +
									// 	'</p></td>' +
									// 	'<td>2016-09-09&nbsp;11:11:11</td>' +
									// '</tr>' +

									// '<tr>' +
									// 	'<td><input type="checkbox" checked="checked" /></td>' +
									// 	'<td><p>尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，' +
									// 	'部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’' +
									// 	'由此给你带来不便，还请多多谅解，感谢您一如既往的支持' +
									// 	'</p></td>' +
									// 	'<td>2016-09-09&nbsp;11:11:11</td>' +
									// '</tr>' +

									// '<tr class="even">' +
									// 	'<td><input type="checkbox" checked="checked" /></td>' +
									// 	'<td><p>尊敬的会员，目前PT电子游艺园收到国际线路的影响，导致游戏暂时无法正常运行，' +
									// 	'部分会员额度放在【PT额度】将会为会员陆续从【PT额度】转回【BB额度】内，还请耐心等待’' +
									// 	'由此给你带来不便，还请多多谅解，感谢您一如既往的支持' +
									// 	'</p></td>' +
									// 	'<td>2016-09-09&nbsp;11:11:11</td>' +
									// '</tr>' +
									this.queryData(0) +
								'</tbody>' +
							'</table>' + 

					 		'<div class="page-content">' +
 								this.pager.getDom() +
 							'</div>' +
						'</div>' +
				'</div>';


		this.el = temp;
	}

	Announcement.prototype.getDom = function(){
		return this.el;
	}

	Announcement.prototype.show = function() {
		this.zone.show();
	}

	Announcement.prototype.hide = function (){
		this.zone.hide();
	}

	Announcement.prototype.queryData = function(pageIndex){
		var dom = '';
		var i = 0;
		var currentData = [];

		currentData = this.announcementData.filter(function(item, index){
			return index >= pageIndex * 5 && index < (pageIndex + 1) * 5;
		});

		for(i = 0; i < currentData.length; i++){
			if (i % 2 == 0) {
				dom +=	'<tr class="odd">' +
							'<td><input type="checkbox" checked="checked" /></td>' +
							'<td><p>' + currentData[i][1] + '</p></td>' +
							'<td>' + currentData[i][2] + '</td>' +							
						'</tr>';
			}else{
				dom +=	'<tr class="even">' +
							'<td><input type="checkbox" checked="checked" /></td>' +
							'<td><p>' + currentData[i][1] + '</p></td>' +
							'<td>' + currentData[i][2] + '</td>' +		
						'</tr>';
			}
		}

		return dom;
	}

	Announcement.prototype.bindData = function(pageIndex){
		var dom = this.queryData(pageIndex);
		this.zone.find('.table-zone  table > tbody').html(dom);
	}

	Announcement.prototype.bindEvents = function(){
		var today = new Date();
		var that = this;

		this.zone = $('.announcement-info');

        today = today.formatDate();

        this.zone.find('.starttime').datetimepicker({value: today + ' 00:00', lang: 'en'});
        this.zone.find('.endtime').datetimepicker({value: today + ' 23:59', lang: 'en'});
		this.button.bindEvents();
		this.pager.bindEvents();
	}


	window.Announcement = Announcement;
}());