(function () {
	function DividendRecord () {
		this.initDom();
	}
	
	DividendRecord.prototype.initDom = function () {
		var temp;

		this.button = new Button({
			id: 'dividend-record-button',
			name: '查询',
			width: 80,
			height: 30
		});

		this.dividendRecordData = [
		    ['2015-01-01', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-02', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-03', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-04', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-05', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-06', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-07', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-08', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-09', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-10', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-11', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-12', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-13', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-14', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-15', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-16', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-17', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-18', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-19', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-20', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-21', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-22', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-23', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-24', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-25', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-26', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-27', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-28', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-29', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-01-30', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-01', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-02', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-03', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-04', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-05', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-06', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-07', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-08', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-09', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-10', '红利状态', '3000.00', '是', '2015-01-09', 1],	
		    ['2015-02-02', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-03', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-04', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-05', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-06', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-07', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-08', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-09', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-10', '红利状态', '3000.00', '是', '2015-01-09', 1],	
		    ['2015-02-02', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-03', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-04', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-05', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-06', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-07', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-08', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-09', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-10', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-02', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-03', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-04', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-05', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-06', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-07', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-08', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-09', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-10', '红利状态', '3000.00', '是', '2015-01-09', 1],	
		    ['2015-02-02', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-03', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-04', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-05', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-06', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-07', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-08', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-09', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-10', '红利状态', '3000.00', '是', '2015-01-09', 1],
		    ['2015-02-11', '红利状态', '3000.00', '是', '2015-01-09', 1]
		];

		this.pager = new Pager({
			id: 'dividend-record-pager',
			callback: this.bindData.bind(this),
			totalCount: this.dividendRecordData.length
		});

		temp = 		'<div class="dividend-record jyjl-money-action">' +
						'<div class="bar-zone">' +
							'<div class="up">' +
								'<div class="time-section">' +
									'<span class="title">日期</span>' +
									'<input class="starttime" type="text"/>' +
									'<span class="divider">-</span>' +
									'<input class="endtime" type="text"/>' +
								'</div>' +

								this.button.getDom() +

								'<ul>' +
									'<li class="selected"><span>今日</span></li>' +
									'<li><span>昨日</span></li>' +
									'<li><span>3日</span></li>' +
									'<li><span>7日</span></li>' +
								'</ul>' +

								'<div class="clear"></div>' +
							'</div>' +

							'<div class="down">' +
								'<span class="text">当前小计</span>' +
								'<span class="value sub-total">2000</span>' +
								'<span class="text">元，总计</span>' +
								'<span class="value total">2000</span>' +
								'<span class="text">元</span>' +
							'</div>' +				
						'</div>' +

						'<div class="table-zone">' +
							'<table>' +
								'<thead><tr>' + 
									'<th>申请时间</th><th>红利类型</th><th>金额</th><th>状态</th><th>发放时间</th>' +
								'</tr></tobdy>' +
								'<tbody>' +
									// '<tr class="odd"><td></td><td></td><td></td><td></td><td></td></tr>' +
									// '<tr class="even"><td></td><td></td><td></td><td></td><td></td></tr>' +
									// '<tr class="odd"><td></td><td></td><td></td><td></td><td></td></tr>' +
									// '<tr class="even"><td></td><td></td><td></td><td></td><td></td></tr>' +
									// '<tr class="odd"><td></td><td></td><td></td><td></td><td></td></tr>' +
									// '<tr class="even"><td></td><td></td><td></td><td></td><td></td></tr>' +									
									this.queryData(0) +
								'</tobdy>' +
 							'</table>' +
 							'<div class="page-content">' +
 								this.pager.getDom() +
 							'</div>' +
						'</div>' +

					'</div>';

		this.el  = temp;
	};

	DividendRecord.prototype.getDom = function () {
		return this.el;
	};

	DividendRecord.prototype.show = function(){
		this.zone.show();
	}

	DividendRecord.prototype.hide = function(){
		this.zone.hide();
	}

	DividendRecord.prototype.queryData = function(pageIndex){
		var dom = '';
		var i = 0;
		var currentData = [];

		currentData = this.dividendRecordData.filter(function(item, index){
			return index >= pageIndex * 10 && index < (pageIndex + 1) * 10;
		});
		 
		for(i = 0; i < currentData.length; i++){
			if (i % 2 == 0) {
				dom +=	'<tr class="odd">' +
							'<td>' + currentData[i][0] + '</td>' +
							'<td>' + currentData[i][1] + '</td>' +
							'<td>' + currentData[i][2] + '</td>' +
							'<td>' + currentData[i][3] + '</td>' +
							'<td>' + currentData[i][4] + '</td>' +
						'</tr>';
			}else{
				dom +=	'<tr class="even">' +
							'<td>' + currentData[i][0] + '</td>' +
							'<td>' + currentData[i][1] + '</td>' +
							'<td>' + currentData[i][2] + '</td>' +
							'<td>' + currentData[i][3] + '</td>' +
							'<td>' + currentData[i][4] + '</td>' +
						'</tr>';
			}
		}

		return dom;
	}

	DividendRecord.prototype.bindData = function(pageIndex){
		var dom = this.queryData(pageIndex);
		this.zone.find('.table-zone  table > tbody').html(dom);
	}

	DividendRecord.prototype.bindEvents = function () {
		var today = new Date();
		var that = this;

		this.zone = $('.dividend-record');

        today = today.formatDate();

        this.zone.find('.starttime').datetimepicker({value: today + ' 00:00', lang: 'en'});
        this.zone.find('.endtime').datetimepicker({value: today + ' 23:59', lang: 'en'});
		
		this.pager.bindEvents();
	};

	window.DividendRecord = DividendRecord;
}());
