(function () {
	function WithdrawRecord () {
		this.initDom();
	}
	
	WithdrawRecord.prototype.initDom = function () {
		var temp;

		this.button = new Button({
			id: 'withdraw-record-button',
			name: '查询',
			width: 80,
			height: 30
		});

		this.withDrawData = [
		    ['2015-01-01', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-02', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-03', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-04', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-05', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-06', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-07', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-08', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-09', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-10', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-11', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-12', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-13', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-14', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-15', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-16', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-17', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-18', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-19', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-20', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-21', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-22', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-23', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-24', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-25', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-26', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-27', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-28', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-29', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-01-30', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-01', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-02', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-03', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-04', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-05', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-06', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-07', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-08', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-09', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-10', '123123', '3000,000.00', '备注','是', 1],	
		    ['2015-02-02', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-03', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-04', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-05', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-06', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-07', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-08', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-09', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-10', '123123', '3000,000.00', '备注','是', 1],	
		    ['2015-02-02', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-03', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-04', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-05', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-06', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-07', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-08', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-09', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-10', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-02', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-03', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-04', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-05', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-06', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-07', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-08', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-09', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-10', '123123', '3000,000.00', '备注','是', 1],	
		    ['2015-02-02', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-03', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-04', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-05', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-06', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-07', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-08', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-09', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-10', '123123', '3000,000.00', '备注','是', 1],
		    ['2015-02-11', '123123', '3000,000.00', '备注','是', 1]
		];

		this.pager = new Pager({
			id: 'withdraw-pager',
			callback: this.bindData.bind(this),
			totalCount: this.withDrawData.length
		});

		temp = 		'<div class="withdraw-record jyjl-money-action">' +
						'<div class="bar-zone">' +
							'<div class="up">' +
								'<div class="time-section">' +
									'<span class="title">日期</span>' +
									'<input class="starttime" type="text"/>' +
									'<span class="divider">-</span>' +
									'<input class="endtime" type="text"/>' +
								'</div>' +

								this.button.getDom() +

								'<ul>' +
									'<li class="selected"><span>今日</span></li>' +
									'<li><span>昨日</span></li>' +
									'<li><span>3日</span></li>' +
									'<li><span>7日</span></li>' +
								'</ul>' +

								'<div class="clear"></div>' +
							'</div>' +

							'<div class="down">' +
								'<span class="text">当前小计</span>' +
								'<span class="value sub-total">2000</span>' +
								'<span class="text">元，总计</span>' +
								'<span class="value total">2000</span>' +
								'<span class="text">元</span>' +
							'</div>' +				
						'</div>' +

						'<div class="table-zone">' +
							'<table>' +
								'<thead><tr>' + 
									'<th>日期</th><th>订单号</th><th>转提款金额</th><th>状态</th><th>备注</th>' +
								'</tr></tobdy>' +
								'<tbody>' +
									// '<tr class="odd"><td></td><td></td><td></td><td></td><td></td></tr>' +
									// '<tr class="even"><td></td><td></td><td></td><td></td><td></td></tr>' +
									// '<tr class="odd"><td></td><td></td><td></td><td></td><td></td></tr>' +
									// '<tr class="even"><td></td><td></td><td></td><td></td><td></td></tr>' +
									// '<tr class="odd"><td></td><td></td><td></td><td></td><td></td></tr>' +
									// '<tr class="even"><td></td><td></td><td></td><td></td><td></td></tr>' +									
									this.queryData(0) +
								'</tobdy>' +
 							'</table>' +
 							'<div class="page-content">' +
 								this.pager.getDom() +
 							'</div>' +
						'</div>' +

					'</div>';

		this.el  = temp;
	};

	WithdrawRecord.prototype.getDom = function () {
		return this.el;
	};

	WithdrawRecord.prototype.show = function(){
		this.zone.show();
	}

	WithdrawRecord.prototype.hide = function(){
		this.zone.hide();
	}

	WithdrawRecord.prototype.queryData = function(pageIndex){
		var dom = '';
		var i = 0;
		var currentData = [];

		currentData = this.withDrawData.filter(function(item, index){
			return index >= pageIndex * 10 && index < (pageIndex + 1) * 10;
		});
		 
		for(i = 0; i < currentData.length; i++){
			if (i % 2 == 0) {
				dom +=	'<tr class="odd">' +
							'<td>' + currentData[i][0] + '</td>' +
							'<td>' + currentData[i][1] + '</td>' +
							'<td>' + currentData[i][2] + '</td>' +
							'<td>' + currentData[i][3] + '</td>' +
							'<td>' + currentData[i][4] + '</td>' +
						'</tr>';
			}else{
				dom +=	'<tr class="even">' +
							'<td>' + currentData[i][0] + '</td>' +
							'<td>' + currentData[i][1] + '</td>' +
							'<td>' + currentData[i][2] + '</td>' +
							'<td>' + currentData[i][3] + '</td>' +
							'<td>' + currentData[i][4] + '</td>' +
						'</tr>';
			}
		}

		return dom;
	}

	WithdrawRecord.prototype.bindData = function(pageIndex){
		var dom = this.queryData(pageIndex);
		this.zone.find('.table-zone  table > tbody').html(dom);
	}

	WithdrawRecord.prototype.bindEvents = function () {
		var today = new Date();
		var that = this;

		this.zone = $('.withdraw-record');

        today = today.formatDate();

        this.zone.find('.starttime').datetimepicker({value: today + ' 00:00', lang: 'en'});
        this.zone.find('.endtime').datetimepicker({value: today + ' 23:59', lang: 'en'});

        this.pager.bindEvents();
	};

	window.WithdrawRecord = WithdrawRecord;
}());
